tap "aws/tap"
tap "esolitos/ipa"
tap "homebrew/bundle"
tap "jeffreywildman/virt-manager"
tap "libsql/sqld"
tap "microsoft/git"
tap "oven-sh/bun"
tap "tursodatabase/tap"
tap "vineelsai26/tap"
tap "xpipe-io/tap"
brew "ansible"
brew "ansible-lint"
brew "autojump"
brew "aws-sam-cli"
brew "python@3.11"
brew "awscli"
brew "bash"
brew "libssh2"
brew "bat"
brew "btop"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "pinentry"
brew "gnupg"
brew "go"
brew "htop"
brew "jq"
brew "lazygit"
brew "meson"
brew "nano"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "ollama"
brew "pigz"
brew "pinentry-mac"
brew "pre-commit"
brew "pv"
brew "pyenv"
brew "rclone"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "rustup-init"
brew "scrcpy"
brew "starship"
brew "telnet"
brew "terraformer"
brew "terragrunt"
brew "tfenv"
brew "tldr"
brew "tmux"
brew "trash"
brew "wakeonlan"
brew "wget"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "esolitos/ipa/sshpass"
brew "jeffreywildman/virt-manager/virt-viewer"
brew "oven-sh/bun/bun"
brew "tursodatabase/tap/turso"
brew "vineelsai26/tap/checkout"
cask "android-platform-tools"
cask "android-studio"
cask "arc"
cask "balenaetcher"
cask "betterdisplay"
cask "brave-browser"
cask "discord"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "hiddenbar"
cask "iterm2"
cask "jellyfin-media-player"
cask "kitty"
cask "linearmouse"
cask "logitech-g-hub"
cask "microsoft-edge"
cask "microsoft-remote-desktop"
cask "nosql-workbench"
cask "notion"
cask "notion-calendar"
cask "obs"
cask "obsidian"
cask "pgadmin4"
cask "postman"
cask "protonvpn"
cask "pycharm-ce"
cask "raspberry-pi-imager"
cask "raycast"
cask "remoteviewer"
cask "slack"
cask "stats"
cask "tailscale"
cask "tigervnc-viewer"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "whatsapp"
cask "zed"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "circleci.circleci"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dotenv.dotenv-vscode"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "howardzuo.vscode-npm-dependency"
vscode "ibm.output-colorizer"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "vineelsai.vscoder"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
